
// Префикс для объектов, встроенных в состав конфигурации
// Если браузер тестов, плагины и утилиты встроены в конфигурцаию,
// то они должны иметь один префикс
Перем ИспользуемыйПрефиксПодсистемы Экспорт;

// { Plugin interface
&НаКлиенте
Функция ОписаниеПлагина(ВозможныеТипыПлагинов) Экспорт
	Возврат ОписаниеПлагинаНаСервере(ВозможныеТипыПлагинов);
КонецФункции

&НаСервере
Функция ОписаниеПлагинаНаСервере(ВозможныеТипыПлагинов)
	Возврат ЭтотОбъектНаСервере().ОписаниеПлагина(ВозможныеТипыПлагинов);
КонецФункции
// } Plugin interface

&НаКлиенте
Функция Разобрать(СтрокаПараметров) Экспорт
	Возврат РазобратьНаСервере(СтрокаПараметров);
КонецФункции

&НаСервере
Функция РазобратьНаСервере(СтрокаПараметров)
	Возврат ЭтотОбъектНаСервере().Разобрать(СтрокаПараметров);
КонецФункции

// { Helpers
&НаСервере
Функция ЭтотОбъектНаСервере()
	Возврат РеквизитФормыВЗначение("Объект");
КонецФункции
// } Helpers
