
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(ПараметрЗапуска) Тогда
		Сообщить("Параметры при запуске ScriptRunnera:");
		Сообщить(""+ПараметрЗапуска);
		//Обработки.xddTestRunner.Создать().ПолучитьФорму().Открыть();
		ФормаxddTestRunner = ПолучитьФормаxddTestRunner();
		ФормаxddTestRunner.Открыть();
	Иначе
		Сообщить("Нет параметров запуска!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьФормаxddTestRunner()
	
	ФормаxddTestRunner = ПолучитьФорму("Обработка.xddTestRunner.Форма.УправляемаяФорма");
	
	Возврат ФормаxddTestRunner;
КонецФункции
