&НаКлиенте
Перем КонтекстЯдра;
&НаКлиенте
Перем Ожидаем;
&НаКлиенте
Перем Утверждения;

&НаКлиенте
Перем ГенераторДанных;

&НаКлиенте
Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра = КонтекстЯдраПараметр;
	Ожидаем = КонтекстЯдра.Плагин("УтвержденияBDD");
	Утверждения = КонтекстЯдра.Плагин("БазовыеУтверждения");
	ГенераторДанных = КонтекстЯдра.Плагин("СериализаторMXL");
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСписокТестов() Экспорт
	ВсеТесты = Новый Массив;
	ВсеТесты.Добавить("ТестДолжен_СоздатьПростойСправочник_И_ПолучитьКоллекциюДанных");
	ВсеТесты.Добавить("ТестДолжен_СоздатьДваНабораЗаписейВРегистреСведенийЧерезНаборЗаписей_И_ПолучитьКоллекциюДанных");
	
	Возврат ВсеТесты;
КонецФункции

&НаКлиенте
Процедура ТестДолжен_СоздатьПростойСправочник_И_ПолучитьКоллекциюДанных() Экспорт
	Макет = ПолучитьМакетОбработки("СозданиеПростогоСправочника");
	ТестовыеДанные = ГенераторДанных.СоздатьДанныеПоТабличномуДокументу(Макет);
	
	ПроверитьСозданиеПростогоСправочника(ТестовыеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТестДолжен_СоздатьДваНабораЗаписейВРегистреСведенийЧерезНаборЗаписей_И_ПолучитьКоллекциюДанных() Экспорт
	Макет = ПолучитьМакетОбработки("СозданиеДвухНаборовЗаписейВРегистреСведений");
	ТестовыеДанные = ГенераторДанных.СоздатьДанныеПоТабличномуДокументу(Макет);
	
	Утверждения.ПроверитьТип(ТестовыеДанные, "Структура", "ТестовыеДанные");
	Утверждения.ПроверитьРавенство(5, ТестовыеДанные.Количество());
КонецПроцедуры
	
&НаСервере
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции

&НаКлиенте
Процедура ПроверитьСозданиеПростогоСправочника(Знач ТестовыеДанные)
	Утверждения.ПроверитьТип(ТестовыеДанные, "Структура", "ТестовыеДанные");
	Утверждения.ПроверитьРавенство(1, ТестовыеДанные.Количество(), "ТестовыеДанные.Количество()");
	
	Утверждения.ПроверитьИстину(ТестовыеДанные.Свойство("ПростойСправочник"), "Ожидали, что есть переменная 'ПростойСправочник'");
	Утверждения.ПроверитьТип(ТестовыеДанные.ПростойСправочник, "СправочникСсылка.ПростойСправочник");
	
КонецПроцедуры