Перем КонтекстЯдра;
Перем Утверждения;
Перем СериализаторMXL;

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра = КонтекстЯдраПараметр;
	Утверждения = КонтекстЯдра.Плагин("БазовыеУтверждения");
	СериализаторMXL = КонтекстЯдра.Плагин("СериализаторMXL");
КонецПроцедуры

Функция ПолучитьСписокТестов() Экспорт
	ВсеТесты = Новый Массив;

	ВсеТесты.Добавить("ТестДолжен_СоздатьПользователяАдмин");

	Возврат ВсеТесты;
КонецФункции

Процедура ТестДолжен_СоздатьПользователяАдмин() Экспорт
	Макет = ПолучитьМакет("ПользовательАдмин");
	ТестовыеДанные = СериализаторMXL.СоздатьДанныеПоТабличномуДокументу(Макет);
КонецПроцедуры
