Перем КонтекстЯдра;

// { Plugin interface

Функция ОписаниеПлагина(ВозможныеТипыПлагинов) Экспорт
	Результат = Новый Структура;
	Результат.Вставить("Тип", ВозможныеТипыПлагинов.Утилита);
	Результат.Вставить("Идентификатор", "Настройки");
	Результат.Вставить("Представление", "Управление внешними настройками тестирования");
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
КонецФункции

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра = КонтекстЯдраПараметр;
	//ПолучитьНастройки();
КонецПроцедуры

// } Plugin interface

// { Settings interface

//&НаКлиенте
Функция ПолучитьНастройки() Экспорт
	Если Настройки = Неопределено Тогда
		ПутьФайлаНастроек = КонтекстЯдра.ПутьФайлаНастроек();
		
		//ФайлНастройки = Новый Файл("C:\projects\xUnitFor1C\fixtures\core\Тесты_Настройки.json");//TODO удалить отладочный код
		//ПутьФайлаНастроек = ФайлНастройки.ПолноеИмя;
		
		Настройки = Новый Структура();
		ФайлНастроек = Новый Файл(ПутьФайлаНастроек);
		Если ФайлНастроек.Существует() Тогда
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.ОткрытьФайл(ПутьФайлаНастроек);

			Настройки = ПрочитатьJSON(ЧтениеJSON, Ложь);
		КонецЕсли;
		Настройки = Новый ФиксированнаяСтруктура(Настройки);
	КонецЕсли; 
	Возврат Настройки;
КонецФункции

//&НаКлиенте
Функция ПолучитьНастройку(Знач КлючНастройки) Экспорт

	ПолучитьНастройки();
	
	Результат = Неопределено;
	Настройки.Свойство(КлючНастройки, Результат);
	Возврат Результат;
	
КонецФункции

// } Settings interface
