Перем КонтекстЯдра;

// { Plugin interface

Функция ОписаниеПлагина(ВозможныеТипыПлагинов) Экспорт
	Результат = Новый Структура;
	Результат.Вставить("Тип", ВозможныеТипыПлагинов.Утилита);
	Результат.Вставить("Идентификатор", "Настройки");
	Результат.Вставить("Представление", "Управление внешними настройками тестирования");
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
КонецФункции

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра = КонтекстЯдраПараметр;	
КонецПроцедуры

// } Plugin interface

// { Settings interface

&НаКлиенте
Функция ПолучитьНастройку(Знач ПутьФайлаНастройки) Экспорт
	ФайлБраузера = Новый Файл(КонтекстЯдра.ИспользуемоеИмяФайла);
	Возврат ПолучитьНастройки(ФайлБраузера, ПутьФайлаНастройки);
КонецФункции

// } Settings interface

&НаКлиенте
Функция ПолучитьНастройки(Знач ФайлБраузера, Знач ПутьФайлаНастройки)
	ИмяФайла = ПутьФайлаНастройки; //"1smoke.json";
	
	ПутьФайлаНастроек = СтрШаблон("%1%2", ФайлБраузера.Путь, ИмяФайла);
	ФайлНастроек = Новый Файл(ПутьФайлаНастроек);
	Если ФайлНастроек.Существует() Тогда
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.ОткрытьФайл(ПутьФайлаНастроек);

		Настройки = ПрочитатьJSON(ЧтениеJSON, Ложь);
		Настройки = Новый ФиксированнаяСтруктура(Настройки);
	КонецЕсли;
	Возврат Настройки;
КонецФункции
