
#Область Дополнительные_внешние_отчеты_и_обработки
	
// Возвращает сведения о внешней обработке.
Функция СведенияОВнешнейОбработке_автоматически() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.3.2.53");
	
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет();
	ПараметрыРегистрации.Версия = "1.1";
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	ПараметрыРегистрации.ОпределитьНастройкиФормы = Истина;
	ПараметрыРегистрации.ОпределитьНастройкиФормы = Истина;
	
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Идентификатор = ЭтотОбъект.Метаданные().Имя;
	НоваяКоманда.Представление = ЭтотОбъект.Метаданные().Синоним;
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	НоваяКоманда.ПоказыватьОповещение = Ложь; 
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = Новый Структура;
	
	РегистрационныеДанные.Вставить("Вид", "ДополнительнаяОбработка");
	РегистрационныеДанные.Вставить("Наименование", ЭтотОбъект.Метаданные().Синоним);
	РегистрационныеДанные.Вставить("Версия", "2.0");
	РегистрационныеДанные.Вставить("БезопасныйРежим", Ложь);
	РегистрационныеДанные.Вставить("Информация", ЭтотОбъект.Метаданные().Синоним);
	
	ТЗКоманды = Новый ТаблицаЗначений;
	
	ТЗКоманды.Колонки.Добавить("Идентификатор");
	ТЗКоманды.Колонки.Добавить("Представление");
	ТЗКоманды.Колонки.Добавить("Модификатор");
	ТЗКоманды.Колонки.Добавить("ПоказыватьОповещение");
	ТЗКоманды.Колонки.Добавить("Использование");    
	
	СтрокаКоманды = ТЗКоманды.Добавить();
	
	СтрокаКоманды.Идентификатор = ЭтотОбъект.Метаданные().Имя;    
	СтрокаКоманды.Представление = ЭтотОбъект.Метаданные().Синоним;
	СтрокаКоманды.ПоказыватьОповещение = Ложь;
	СтрокаКоманды.Использование = "ОткрытиеФормы";
	
	РегистрационныеДанные.Вставить("Команды", ТЗКоманды);    
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
    НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ИмяВарианта");
КонецПроцедуры

Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
   Настройки.ВыводитьСуммуВыделенныхЯчеек = Истина;
КонецПроцедуры

#КонецОбласти

// { Plugin interface
Функция ОписаниеПлагина(ВозможныеТипыПлагинов) Экспорт
	Результат = Новый Структура;
	Результат.Вставить("Тип", ВозможныеТипыПлагинов.Утилита);
	МетаданныеПлагина = Метаданные();
	Результат.Вставить("Идентификатор", МетаданныеПлагина.Имя);
	Результат.Вставить("Представление", МетаданныеПлагина.Синоним);
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
КонецФункции

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
КонецПроцедуры
// } Plugin interface
