&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ИмяТипаМетаданных",ИмяТипаМетаданных);
	Параметры.Свойство("ПолноеИмяМетаданных",ПолноеИмяМетаданных);
	Если Параметры.Свойство("ДокументСсылка") 
		И НЕ Параметры.ДокументСсылка=Неопределено Тогда
		ДокументСсылка = Параметры.ДокументСсылка;
		ИсходныйДокумент = ДокументСсылка;
		//ИмяТипаМетаданных = ОбъектДанныхСсылка.Метаданные.Имя;
		стр_н = ЛогТекущихПорядкаВыбораСсылок.Добавить();
		стр_н.Ссылка = ДокументСсылка;
	КонецЕсли;
	
	Если ИмяТипаМетаданных="Документ" Тогда
		Попытка
			ТипДокументСсылка = новый ОписаниеТипов("ДокументСсылка."+ПолноеИмяМетаданных);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
	Если ЗначениеЗаполнено(ДокументСсылка)Тогда
		ВывестиСтруктуруПодчиненности();
	КонецЕсли;
	
	ГлубинаИстории = "("+?(ЛогТекущихПорядкаВыбораСсылок.Количество()=0,0,ЛогТекущихПорядкаВыбораСсылок.Количество()-1)+")";
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьИПрименить(Команда)
	
	мПараметры = новый Структура;
	мПараметры.Вставить("МассивВыбранныхДанных",ПолучитьМассивСсылокДокументовИзКорзины());
	Оповестить("ВыборВыгрузкиПоСтруктуреПодчиненности",мПараметры);
	ЭтаФорма.Закрыть();

КонецПроцедуры

&НаСервере
Функция ПолучитьМассивСсылокДокументовИзКорзины()
	
	МассивСтруктурСсылок = новый Массив;  	
	
	Для каждого стр из КорзинаСсылок Цикл
		мСтруктура = новый Структура;
		мСтруктура.Вставить("Ссылка",стр.Ссылка);
		мСтруктура.Вставить("ИмяТипаМетаданных","Документ");
		мСтруктура.Вставить("ПолноеИмяМетаданных",стр.Ссылка.Метаданные().Имя);
		МассивСтруктурСсылок.Добавить(мСтруктура);
	КонецЦикла;
	
	Возврат МассивСтруктурСсылок;
	
КонецФункции

&НаКлиенте
Процедура ВывестиДляТекущего(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаСтруктураПодчиненности.ТекущиеДанные;
	
	Если ТекущиеДанные=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	
	ТипДокументСсылка = ПолучитьОписаниеТипМетаданныхПоСсылке(ТекущиеДанные.Ссылка);
	Элементы.ДокументСсылка.ОграничениеТипа = ТипДокументСсылка;

	ДокументСсылка = ТекущиеДанные.Ссылка;
	ВывестиСтруктуруПодчиненности();
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьОписаниеТипМетаданныхПоСсылке(Ссылка)
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Неопределено;
	КонецЕсли;		
	
	ОписаниеТипа = новый ОписаниеТипов("ДокументСсылка."+Ссылка.Метаданные().Имя);
	
	Возврат ОписаниеТипа;
	
КонецФункции

&НаКлиенте
Процедура Обновить(Команда)
	ВывестиСтруктуруПодчиненности();
КонецПроцедуры

&НаКлиенте
Процедура ПоместитьВКорзину(Команда)
	
	Для каждого стр из ТаблицаСтруктураПодчиненности Цикл
		
		Если стр.Выбрана=Ложь Тогда
			Продолжить;
		КонецЕсли;
		
		// может есть ссылка?
		мОтбор = новый Структура("Ссылка",стр.Ссылка);
		нСтроки = КорзинаСсылок.НайтиСтроки(мОтбор);
		
		Если нСтроки.Количество()>0 Тогда
			Продолжить;
		КонецЕсли;
		
		стр_н = КорзинаСсылок.Добавить();
		ЗаполнитьЗначенияСвойств(стр_н,стр);
		
	КонецЦикла;
	
	
	ИзменитьЗаголовокПоместитьВКорзину();

	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЗаголовокПоместитьВКорзину()
	
	Элементы.ГруппаКорзина.Заголовок = "Корзина ("+КорзинаСсылок.Количество()+")";

КонецПроцедуры

#Область Служебные

// Инициирует вывод в табличный документ и отображает его по окончанию формирования.
&НаКлиенте
Процедура ВывестиСтруктуруПодчиненности()

	Если НЕ ЗначениеЗаполнено(ДокументСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьДеревоСтруктурыПодчиненности();

КонецПроцедуры

&НаСервере
Процедура ОбновитьДеревоСтруктурыПодчиненности(ВозвратНазад = Ложь)

	ПоследняяСсылка = Неопределено;
	
	Если ЛогТекущихПорядкаВыбораСсылок.Количество()>0 Тогда
		стр = ЛогТекущихПорядкаВыбораСсылок[ЛогТекущихПорядкаВыбораСсылок.Количество()-1];
		ПоследняяСсылка = стр.Ссылка;
	КонецЕсли;
	
	Если ПоследняяСсылка<>ДокументСсылка И ВозвратНазад=Ложь Тогда
		стр_н = ЛогТекущихПорядкаВыбораСсылок.Добавить();
		стр_н.Ссылка = ДокументСсылка;
	КонецЕсли;
	
	Если ЛогТекущихПорядкаВыбораСсылок.Количество()>1 Тогда
		Элементы.ФормаВернутьсяНазад.Доступность = Истина;
	КонецЕсли;
	
	ГлубинаИстории = "("+?(ЛогТекущихПорядкаВыбораСсылок.Количество()=0,0,ЛогТекущихПорядкаВыбораСсылок.Количество()-1)+")";
	
	Если ОсновнойДокументДоступен() Тогда
		СформироватьДеревьяДокументов();
		ВывестиТабличныйДокумент();
	Иначе
		Сообщить(
			Нстр("ru = 'Объект, для которого сформирован отчет о структуре подчиненности, стал недоступен.'"));
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ОсновнойДокументДоступен()

	Если Не ПравоДоступа("Чтение", ДокументСсылка.Метаданные()) Тогда
		Возврат Ложь;
	КонецЕсли;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	1
	|ИЗ
	|	Документ." + ДокументСсылка.Метаданные().Имя + " КАК Таб
	|ГДЕ
	|	Таб.Ссылка = &ТекущийДокумент
	|");
	Запрос.УстановитьПараметр("ТекущийДокумент", ДокументСсылка);
	Возврат Не Запрос.Выполнить().Пустой();
	
	Возврат Истина;

КонецФункции

&НаСервере
Процедура СформироватьДеревьяДокументов()

	ДеревоРодительскиеДокументы.ПолучитьЭлементы().Очистить();
	ДеревоПодчиненныеДокументы.ПолучитьЭлементы().Очистить();

	ВывестиРодительскиеДокументы(ДокументСсылка,ДеревоРодительскиеДокументы);
	ВывестиПодчиненныеДокументы(ДокументСсылка,ДеревоПодчиненныеДокументы);
	
	////Удалим лишнюю вложенность, если нужно
	//Если ЭтаФорма.ппк_УпрощенноеДерево Тогда
		УдалитьЛишнююВложенностьВДереве("ДеревоРодительскиеДокументы");
		УдалитьЛишнююВложенностьВДереве("ДеревоПодчиненныеДокументы");
	//КонецЕсли;
	
КонецПроцедуры

// Выводит дерево подчиненности в табличный документ.
&НаСервере
Процедура ВывестиТабличныйДокумент()

	СтруктураПодчиненности.ПолучитьЭлементы().Очистить();
	ТаблицаСтруктураПодчиненности.Очистить();
	
	ВывестиРодительскиеЭлементыДерева(ДеревоРодительскиеДокументы.ПолучитьЭлементы(),ТаблицаСтруктураПодчиненности,1);
	ВывестиТекущийДокумент(ТаблицаСтруктураПодчиненности);
	ВывестиПодчиненныеЭлементыДерева(ДеревоПодчиненныеДокументы.ПолучитьЭлементы(),ТаблицаСтруктураПодчиненности,1)
	
КонецПроцедуры

&НаСервере
Процедура ВывестиРодительскиеДокументы(ТекущийДокумент,ДеревоРодитель)

	УстановитьПривилегированныйРежим(Истина); 
	
	СтрокиДерева = ДеревоРодитель.ПолучитьЭлементы();
	МетаданныеДокумента = ТекущийДокумент.Метаданные();
	СписокРеквизитов    = Новый СписокЗначений;
	
	Для Каждого Реквизит Из МетаданныеДокумента.Реквизиты Цикл
		
		Если Метаданные.КритерииОтбора.СвязанныеДокументы.Состав.Содержит(Реквизит) Тогда
			
			Для Каждого ТекущийТип Из Реквизит.Тип.Типы() Цикл
				
				МетаданныеРеквизита = Метаданные.НайтиПоТипу(ТекущийТип);
				
				Если МетаданныеРеквизита <> Неопределено
					И Метаданные.Документы.Содержит(МетаданныеРеквизита)
					И ПравоДоступа("Чтение", МетаданныеРеквизита) Тогда
					
					ЗначениеРеквизита = ТекущийДокумент[Реквизит.Имя];
					
					Если ЗначениеЗаполнено(ЗначениеРеквизита)
						И ТипЗнч(ЗначениеРеквизита) = ТекущийТип
						И ЗначениеРеквизита <> ТекущийДокумент
						И СписокРеквизитов.НайтиПоЗначению(ЗначениеРеквизита) = Неопределено Тогда
						
						СписокРеквизитов.Добавить(ЗначениеРеквизита,Формат(ЗначениеРеквизита.Дата,"ДЛФ=DT"));
						
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;

	Для Каждого ТЧ Из МетаданныеДокумента.ТабличныеЧасти Цикл
		СтрРеквизитов = "";

		СодержимоеТЧ = ТекущийДокумент[ТЧ.Имя].Выгрузить();

		Для Каждого Реквизит Из ТЧ.Реквизиты Цикл

			Если Метаданные.КритерииОтбора.СвязанныеДокументы.Состав.Содержит(Реквизит) Тогда
				
				Для Каждого ТекущийТип Из Реквизит.Тип.Типы() Цикл
					
					МетаданныеРеквизита = Метаданные.НайтиПоТипу(ТекущийТип);
					
					Если МетаданныеРеквизита<>Неопределено
						И Метаданные.Документы.Содержит(МетаданныеРеквизита)
						И ПравоДоступа("Чтение", МетаданныеРеквизита) Тогда
						
						СтрРеквизитов = СтрРеквизитов + ?(СтрРеквизитов = "", "", ", ") + Реквизит.Имя;
						Прервать;
						
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;

		СодержимоеТЧ.Свернуть(СтрРеквизитов);
		Для Каждого КолонкаТЧ Из СодержимоеТЧ.Колонки Цикл

			Для Каждого СтрокаТЧ Из СодержимоеТЧ Цикл

				ЗначениеРеквизита = СтрокаТЧ[КолонкаТЧ.Имя];

				МетаданныеЗначения = Метаданные.НайтиПоТипу(ТипЗнч(ЗначениеРеквизита));
				Если МетаданныеЗначения <> Неопределено Тогда

					Если ЗначениеЗаполнено(ЗначениеРеквизита)
						И Метаданные.Документы.Содержит(МетаданныеЗначения)
						И ЗначениеРеквизита <> ТекущийДокумент
						И СписокРеквизитов.НайтиПоЗначению(ЗначениеРеквизита) = Неопределено
						И ПравоДоступа("Чтение", МетаданныеЗначения) Тогда

							СписокРеквизитов.Добавить(ЗначениеРеквизита,Формат(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗначениеРеквизита, "Дата"),"ДЛФ=DT"));

					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

	СписокРеквизитов.СортироватьПоПредставлению();
	
	УстановитьПривилегированныйРежим(Ложь); //Шамонтьев ERP-1139 21.06.2016
	
	Для каждого ЭлементСписка Из СписокРеквизитов Цикл
		
		Выборка = ПолучитьВыборкуПоРеквизитамДокумента(ЭлементСписка.Значение);
		
		Если Выборка.Следующий() Тогда
			СтрокаДерева = ДобавитьСтрокуВДерево(СтрокиДерева, Выборка);
			Если НЕ ДобавляемыйДокументИмеетсяСредиРодителей(ДеревоРодитель,ЭлементСписка.Значение) Тогда
				ВывестиРодительскиеДокументы(ЭлементСписка.Значение,СтрокаДерева);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Получает выборку по реквизитам документа.
//
// Параметры:
//  ДокументСсылка  - ДокументСсылка - документ, значения реквизитов которого получаются запросом.
//
// Возвращаемое значение:
//   ВыборкаИзРезультатаЗапроса
//
&НаСервере
Функция ПолучитьВыборкуПоРеквизитамДокумента(ДокументСсылка)
	
	МетаданныеДокумента = ДокументСсылка.Метаданные();
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Ссылка,
	|	Проведен,
	|	ПометкаУдаления,
//	|	#Сумма,
//	|	#Валюта,
	|	#Представление
	|ИЗ
	|	Документ." + МетаданныеДокумента.Имя + "
	|ГДЕ
	|	Ссылка = &Ссылка
	|";
	//ЗаменитьТекстЗапроса(ТекстЗапроса, МетаданныеДокумента, "#Сумма", ИмяРеквизитаДокумента(МетаданныеДокумента.Имя, "СуммаДокумента"), "СуммаДокумента");
	//ЗаменитьТекстЗапроса(ТекстЗапроса, МетаданныеДокумента, "#Валюта", ИмяРеквизитаДокумента(МетаданныеДокумента.Имя, "Валюта"), "Валюта");
	
	МассивДопРеквизитов = СтруктураПодчиненностиПереопределяемый_МассивДополнительныхРеквизитовДокумента(МетаданныеДокумента.Имя);
	
	ДополнитьТекстЗапросаПоРеквизитамДокумента(ТекстЗапроса, МассивДопРеквизитов);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	//Шамонтьев ERP-1139 21.06.2016 +
	//Возврат Запрос.Выполнить().Выбрать(); 
	
	УстановитьПривилегированныйРежим(Истина);
	ВыборкаПоРеквизитамДокумента = Запрос.Выполнить().Выбрать(); 
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ВыборкаПоРеквизитамДокумента;
	//Шамонтьев ERP-1139 21.06.2016
	
КонецФункции


&НаСервере
Процедура ВывестиПодчиненныеДокументы(ТекущийДокумент,ДеревоРодитель)
	
	УстановитьПривилегированныйРежим(Истина); 
	
	СтрокиДерева = ДеревоРодитель.ПолучитьЭлементы();
	Таблица      = ПолучитьСписокДокументовПоКритериюОтбора(ТекущийДокумент);
	Если Таблица = Неопределено Тогда
		Возврат;
	КонецЕсли;

	КэшПоТипамДокументов   = Новый Соответствие;
	КэшРеквизитовДокумента = Новый Соответствие;

	Для Каждого СтрокаТаблицы Из Таблица Цикл

		МетаданныеДокумента = СтрокаТаблицы.Ссылка.Метаданные();
		Если Не ПравоДоступа("Чтение", МетаданныеДокумента) Тогда
			Продолжить;
		КонецЕсли;

		ИмяДокумента = МетаданныеДокумента.Имя;
		ДополнитьКэшМетаданных(МетаданныеДокумента, ИмяДокумента,КэшРеквизитовДокумента);

		МассивСсылок = КэшПоТипамДокументов[ИмяДокумента];
		Если МассивСсылок = Неопределено Тогда

			МассивСсылок = Новый Массив;
			КэшПоТипамДокументов.Вставить(ИмяДокумента, МассивСсылок);

		КонецЕсли;

		МассивСсылок.Добавить(СтрокаТаблицы.Ссылка);

	КонецЦикла;
	
	Если КэшПоТипамДокументов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ТекстЗапросаНачало = "ВЫБРАТЬ РАЗРЕШЕННЫЕ * ИЗ (";
	ТекстЗапросаКонец = ") КАК ПодчиненныеДокументы УПОРЯДОЧИТЬ ПО ПодчиненныеДокументы.Дата";

	Запрос = Новый Запрос;
	ТекстЗапроса = "";
	Для Каждого КлючИЗначение Из КэшПоТипамДокументов Цикл

		ТекстПоТипуДокумента = "
		|	Дата,
		|	Ссылка,
		|	Проведен,
		|	ПометкаУдаления,
		|" + КэшРеквизитовДокумента[КлючИЗначение.Ключ]["СуммаДокумента"] + " КАК СуммаДокумента,
		|" + КэшРеквизитовДокумента[КлючИЗначение.Ключ]["Валюта"] + "         КАК Валюта,
		|	#Представление
		|ИЗ
		|	Документ." + КлючИЗначение.Ключ + "
		|ГДЕ
		|	Ссылка В (&" + КлючИЗначение.Ключ + ")";
		
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		
		МассивДопРеквизитов = СтруктураПодчиненностиПереопределяемый_МассивДополнительныхРеквизитовДокумента(КлючИЗначение.Ключ);
		ДополнитьТекстЗапросаПоРеквизитамДокумента(ТекстПоТипуДокумента, МассивДопРеквизитов);
		
		ТекстЗапроса = ТекстЗапроса + ?(ТекстЗапроса = "", " ВЫБРАТЬ ", " ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ") + ТекстПоТипуДокумента;

	КонецЦикла;

	Запрос.Текст = ТекстЗапросаНачало + ТекстЗапроса + ТекстЗапросаКонец;
	Выборка = Запрос.Выполнить().Выбрать();
	
	УстановитьПривилегированныйРежим(Ложь); 

	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ДобавитьСтрокуВДерево(СтрокиДерева, Выборка);
		Если НЕ ДобавляемыйДокументИмеетсяСредиРодителей(ДеревоРодитель,Выборка.Ссылка) Тогда
			ВывестиПодчиненныеДокументы(Выборка.Ссылка,НоваяСтрока)
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПолучитьСписокДокументовПоКритериюОтбора(ЗначениеКритерияОтбора)
	
	Если Метаданные.КритерииОтбора.СвязанныеДокументы.Тип.СодержитТип(ТипЗнч(ЗначениеКритерияОтбора))  Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	СвязанныеДокументы.Ссылка
		|ИЗ
		|	КритерийОтбора.СвязанныеДокументы(&ЗначениеКритерияОтбора) КАК СвязанныеДокументы";
		
		Запрос.УстановитьПараметр("ЗначениеКритерияОтбора",ЗначениеКритерияОтбора);
		Возврат Запрос.Выполнить().Выгрузить();
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

// Определяет наличие документа среди родителей строки дерева, которая возможно будет добавлена.
//
// Параметры:
//  СтрокаРодитель  - ДанныеФормыДерево,ДанныеФормыЭлементДерева - родитель, для 
//                 которого предполагается добавить строку дерева.
//  ДокументСсылка  - Документ - документ, на наличие которого выполняется проверка.
//
// Возвращаемое значение:
//   Булево   - Истина если найден, Ложь в обратном случае.
//
Функция ДобавляемыйДокументИмеетсяСредиРодителей(СтрокаРодитель,ИскомыйДокумент)
	
	Если ИскомыйДокумент = ДокументСсылка Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ТипЗнч(СтрокаРодитель) = Тип("ДанныеФормыДерево") Тогда
		Возврат Ложь; 
	КонецЕсли;
	
	ТекущийРодитель = СтрокаРодитель;
	Пока ТекущийРодитель <> Неопределено Цикл
		Если ТекущийРодитель.Ссылка = ИскомыйДокумент Тогда
		    Возврат Истина;
		КонецЕсли;
		ТекущийРодитель = ТекущийРодитель.ПолучитьРодителя();
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция ДобавитьСтрокуВДерево(СтрокиДерева, Выборка)

	НоваяСтрока = СтрокиДерева.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка, "Ссылка, Представление,  Проведен, ПометкаУдаления");
	
	ПереопределенноеПредставление = СтруктураПодчиненностиПереопределяемый_ПолучитьПредставлениеДокументаДляПечати(Выборка);
	Если ПереопределенноеПредставление <> Неопределено Тогда
		//НоваяСтрока.Представление = ПереопределенноеПредставление;
		НоваяСтрока.Представление = ПереопределенноеПредставление.ПредставлениеДокумента;
		НоваяСтрока.ппк_Недоступен = ПереопределенноеПредставление.НетПравНаЧтение;
	Иначе
		НоваяСтрока.Представление = ПолучитьПредставлениеДокументаДляПечати(Выборка);
	КонецЕсли;
	
	Возврат НоваяСтрока;

КонецФункции

&НаСервере
Процедура ДополнитьТекстЗапросаПоРеквизитамДокумента(ТекстЗапроса, МассивРеквизитов)
	
	ТекстПредставление = "Представление КАК Представление";
	
	Для Инд = 1 По 3 Цикл
		
		ТекстПредставление = ТекстПредставление + ",
			|	" + ?(МассивРеквизитов.Количество() >= Инд,МассивРеквизитов[инд - 1],"NULL") + " Как ДополнительныйРеквизит" + Инд;
		
	КонецЦикла;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#Представление", ТекстПредставление);
	
КонецПроцедуры

Функция ИмяРеквизитаДокумента(ИмяДокумента, Реквизит) 
	
	ИмяРеквизитаДокумента = СтруктураПодчиненностиПереопределяемый_ИмяРеквизитаДокумента(ИмяДокумента, Реквизит); 
	
	Если Реквизит = "СуммаДокумента" Тогда
		Возврат ?(ИмяРеквизитаДокумента = Неопределено,"СуммаДокумента",ИмяРеквизитаДокумента);
	ИначеЕсли Реквизит = "Валюта" Тогда
		Возврат ?(ИмяРеквизитаДокумента = Неопределено,"Валюта",ИмяРеквизитаДокумента);
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ДополнитьКэшМетаданных(МетаданныеДокумента, ИмяДокумента,КэшРеквизитовДокумента)

	РеквизитыДокумента = КэшРеквизитовДокумента[ИмяДокумента];
	Если РеквизитыДокумента = Неопределено Тогда
		
		РеквизитыДокумента = Новый Соответствие;
		
		ИмяРеквизитаСуммаДокумента = ИмяРеквизитаДокумента(МетаданныеДокумента.Имя, "СуммаДокумента");
		Если МетаданныеДокумента.Реквизиты.Найти(ИмяРеквизитаСуммаДокумента) <> Неопределено Тогда
			РеквизитыДокумента.Вставить("СуммаДокумента", ИмяРеквизитаСуммаДокумента);
		Иначе
			РеквизитыДокумента.Вставить("СуммаДокумента", "NULL");
		КонецЕсли;
		
		ИмяРеквизитаВалюта = ИмяРеквизитаДокумента(МетаданныеДокумента.Имя, "Валюта");
		Если МетаданныеДокумента.Реквизиты.Найти(ИмяРеквизитаВалюта) <> Неопределено Тогда
			РеквизитыДокумента.Вставить("Валюта", ИмяРеквизитаВалюта);
		Иначе
			РеквизитыДокумента.Вставить("Валюта", "NULL");
		КонецЕсли;

		КэшРеквизитовДокумента.Вставить(ИмяДокумента, РеквизитыДокумента);

	КонецЕсли;
	
КонецПроцедуры

// Формирует представление документа для вывода в табличный документ.
//
// Параметры:
//  Выборка  - ВыборкаИзРезультатаЗапроса или ДанныеФормыЭлементДерева - набор данных
//             на основании которого формируется представление.
//
// Возвращаемое значение:
//   Строка   - сформированное представление.
//
&НаСервере
Функция ПолучитьПредставлениеДокументаДляПечати(Выборка)
	
	ПредставлениеДокумента = Выборка.Представление;
//	Если (Выборка.СуммаДокумента <> 0) И (Выборка.СуммаДокумента <> NULL) Тогда
//		ПредставлениеДокумента = ПредставлениеДокумента + " " + НСтр("ru='на сумму'") + " " + Выборка.СуммаДокумента + " " + Выборка.Валюта;
//	КонецЕсли;
	
	Возврат ПредставлениеДокумента;
	
КонецФункции


&НаСервере
Процедура УдалитьЛишнююВложенностьВДереве(ИмяДерева) 
	
	Дерево = РеквизитФормыВЗначение(ИмяДерева, Тип("ДеревоЗначений"));
	УдалитьЛишнююВложенность(Дерево, Дерево.Строки);
	ЗначениеВРеквизитФормы(Дерево, ИмяДерева);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЛишнююВложенность(Дерево, СтрокиДерева)
	
	ВсегоСтрок = СтрокиДерева.Количество() - 1;
	Для ИндексСтроки=0 По ВсегоСтрок Цикл
		СтрокаМаксимальногоУровня = Неопределено;
		МаксимальныйУровень = -1;
		
		ТекущаяСтрока = СтрокиДерева[ВсегоСтрок-ИндексСтроки];
		СтрокиПоСсылке = Дерево.Строки.НайтиСтроки(Новый Структура("Ссылка", ТекущаяСтрока.Ссылка), Истина);

		Для Каждого СтрокаПоСсылке Из СтрокиПоСсылке Цикл
			ТекущийУровень = СтрокаПоСсылке.Уровень();
			Если ТекущийУровень>=МаксимальныйУровень Тогда
				МаксимальныйУровень = ТекущийУровень;
				
				Если СтрокаМаксимальногоУровня<>Неопределено Тогда
					Родитель = СтрокаМаксимальногоУровня.Родитель;
					Если Родитель=Неопределено Тогда
						Родитель = Дерево;
					КонецЕсли;
					Родитель.Строки.Удалить(СтрокаМаксимальногоУровня);
				КонецЕсли;
				СтрокаМаксимальногоУровня = СтрокаПоСсылке;
				
			Иначе
				
				Родитель = СтрокаПоСсылке.Родитель;
				Если Родитель=Неопределено Тогда
					Родитель = Дерево;
				КонецЕсли;
				Родитель.Строки.Удалить(СтрокаПоСсылке);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл //это уже те строки, которые точно остались
		УдалитьЛишнююВложенность(Дерево, СтрокаДерева.Строки);
	КонецЦикла;
	
КонецПроцедуры



&НаСервере
Процедура ВывестиРодительскиеЭлементыДерева(СтрокиДерева,Таблица,УровеньРекурсии)
	
	Счетчик =  СтрокиДерева.Количество();
	Пока Счетчик >0 Цикл
		
		ТекущаяСтрокаДерева = СтрокиДерева.Получить(Счетчик -1);
		ПодчиненныеЭлементыСтрокиДерева = ТекущаяСтрокаДерева.ПолучитьЭлементы();
		ВывестиРодительскиеЭлементыДерева(ПодчиненныеЭлементыСтрокиДерева,Таблица,УровеньРекурсии + 1);
		
		//Для инд=1 По УровеньРекурсии Цикл
		//	
		//	Если инд = УровеньРекурсии Тогда
		//		
		//		Если СтрокиДерева.Индекс(ТекущаяСтрокаДерева) < (СтрокиДерева.Количество()-1) Тогда
		//			Область = Макет.ПолучитьОбласть("КоннекторВерхПравоНиз");
		//		Иначе	
		//			Область = Макет.ПолучитьОбласть("КоннекторПравоНиз");
		//		КонецЕсли;
		//		
		//	Иначе
		//		
		//		Если НеобходимостьВыводаВертикальногоКоннектора(УровеньРекурсии - инд + 1,ТекущаяСтрокаДерева,Ложь) Тогда
		//			Область = Макет.ПолучитьОбласть("КоннекторВерхНиз");
		//		Иначе
		//			Область = Макет.ПолучитьОбласть("Отступ");
		//			
		//		КонецЕсли;
		//		
		//	КонецЕсли;
		//	
		//	Если инд = 1 Тогда
		//		ТаблицаОтчета.Вывести(Область);
		//	Иначе
		//		ТаблицаОтчета.Присоединить(Область);
		//	КонецЕсли;
		//	
		//КонецЦикла;
		
		//Шамонтьев ERP-1139 21.06.2016 +
		//ВывестиДокументИКартинку(ТекущаяСтрокаДерева,Макет,Ложь,Ложь);
		ВывестиДокументИКартинку(ТекущаяСтрокаДерева,Таблица,УровеньРекурсии+1,Ложь,Ложь);
		//Шамонтьев ERP-1139 21.06.2016 -

		Счетчик = Счетчик - 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиТекущийДокумент(Таблица)
	
	Выборка = ПолучитьВыборкуПоРеквизитамДокумента(ДокументСсылка);
	Если Выборка.Следующий() Тогда
		
		ПереопределяемоеПредставление = СтруктураПодчиненностиПереопределяемый_ПолучитьПредставлениеДокументаДляПечати(Выборка);
		
		Если ПереопределяемоеПредставление <> Неопределено Тогда
			СтруктураРеквизитов = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка.Владелец().Выгрузить()[0]);
			//Шамонтьев ERP-1139 21.06.2016 +
			//СтруктураРеквизитов.Представление = ПереопределяемоеПредставление;
			//ВывестиДокументИКартинку(СтруктураРеквизитов,Макет,Истина);
			СтруктураРеквизитов.Представление = ПереопределяемоеПредставление.ПредставлениеДокумента;
			ВывестиДокументИКартинку(СтруктураРеквизитов,Таблица,0,Истина,,ПереопределяемоеПредставление.НетПравНаЧтение);
			//Шамонтьев ERP-1139 21.06.2016 -
		Иначе
			СтруктураРеквизитов = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка.Владелец().Выгрузить()[0]);
			СтруктураРеквизитов.Представление = ПолучитьПредставлениеДокументаДляПечати(СтруктураРеквизитов);
			ВывестиДокументИКартинку(СтруктураРеквизитов,Таблица,0,Истина);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиПодчиненныеЭлементыДерева(СтрокиДерева,Таблица,УровеньРекурсии)

	Для каждого СтрокаДерева Из СтрокиДерева Цикл
		
		ЭтоТекущийДокумент = (СтрокаДерева.Ссылка = ДокументСсылка);
		ЭтоИсходныйДокумент = (СтрокаДерева.Ссылка = ИсходныйДокумент);
		ПодчиненныеЭлементыДерева = СтрокаДерева.ПолучитьЭлементы();
		
		// Вывод коннекторов
		//Для инд = 1 По УровеньРекурсии Цикл
		//	Если УровеньРекурсии > инд Тогда
		//		
		//		Если НеобходимостьВыводаВертикальногоКоннектора(УровеньРекурсии - инд + 1,СтрокаДерева) Тогда
		//			Область = Макет.ПолучитьОбласть("КоннекторВерхНиз");
		//		Иначе
		//			Область = Макет.ПолучитьОбласть("Отступ");
		//			
		//		КонецЕсли;
		//	Иначе 
		//		
		//		Если СтрокиДерева.Количество() > 1 И (СтрокиДерева.Индекс(СтрокаДерева)<> (СтрокиДерева.Количество()-1)) Тогда
		//			Область = Макет.ПолучитьОбласть("КоннекторВерхПравоНиз");
		//		Иначе
		//			Область = Макет.ПолучитьОбласть("КоннекторВерхПраво");
		//		КонецЕсли;
		//		
		//	КонецЕсли;	
		//	
		//	Область.Параметры.Документ = ?(ЭтоИсходныйДокумент,Неопределено,СтрокаДерева.Ссылка);
		//	
		//	Если инд = 1 Тогда
		//		ТаблицаОтчета.Вывести(Область);
		//	Иначе
		//		ТаблицаОтчета.Присоединить(Область);
		//	КонецЕсли;
		//	
		//КонецЦикла;		
		
		//Шамонтьев ERP-1139 21.06.2016 +
		//ВывестиДокументИКартинку(СтрокаДерева,Макет,Ложь,Истина);
		ВывестиДокументИКартинку(СтрокаДерева,Таблица,УровеньРекурсии+1,Ложь,Истина);
		//Шамонтьев ERP-1139 21.06.2016 -
		
		// Вывод подчиненных элементов дерева.
		ВывестиПодчиненныеЭлементыДерева(ПодчиненныеЭлементыДерева,Таблица,УровеньРекурсии + 1);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиДокументИКартинку(СтрокаДерева,Таблица,Отступ,ЭтоТекущийДокумент = Ложь,ЭтоПодчиненный = Неопределено, ЭтоНедоступныйПоПравам=Ложь)
	ПредставлениеОтступа = "";
	Если Отступ<>0 Тогда
		Для стр=0 по Отступ Цикл
			ПредставлениеОтступа = ПредставлениеОтступа+"...";
		КонецЦикла;
	КонецЕсли;
	стр_н =Таблица.Добавить();
	стр_н.Ссылка =  СтрокаДерева.Ссылка;
	стр_н.ПредставлениеОтступа = ПредставлениеОтступа;
	стр_н.Представление = СтрокаДерева.Представление;
	стр_н.Проведен =  СтрокаДерева.Проведен;
	стр_н.ПометкаУдаления =  СтрокаДерева.ПометкаУдаления;
	Если стр_н.Ссылка = ДокументСсылка Тогда
		стр_н.ВыбранныйЭлемент = Истина;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура УстановитьФлажки(Команда)
	Для каждого стр из ТаблицаСтруктураПодчиненности Цикл
		стр.Выбрана = Истина;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура СнятьФлажки(Команда)
	Для каждого стр из ТаблицаСтруктураПодчиненности Цикл
		стр.Выбрана = Ложь;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура КорзинаСсылокПриИзменении(Элемент)
	ИзменитьЗаголовокПоместитьВКорзину();
КонецПроцедуры


&НаКлиенте
Процедура ДокументСсылкаПриИзменении(Элемент)
	ВывестиСтруктуруПодчиненности();
КонецПроцедуры

&НаКлиенте
Процедура ВернутьсяНазад(Команда)
	Если ЛогТекущихПорядкаВыбораСсылок.Количество()>0 Тогда
		стр = ЛогТекущихПорядкаВыбораСсылок[ЛогТекущихПорядкаВыбораСсылок.Количество()-1];
		Если ДокументСсылка=стр.Ссылка Тогда
			Если ЛогТекущихПорядкаВыбораСсылок.Количество()>=2 Тогда
				ЛогТекущихПорядкаВыбораСсылок.Удалить(стр);
				стр2 = ЛогТекущихПорядкаВыбораСсылок[ЛогТекущихПорядкаВыбораСсылок.Количество()-1];
				ДокументСсылка = стр2.Ссылка;
			КонецЕсли;
		Иначе
			ДокументСсылка = стр.Ссылка;
			Если ЛогТекущихПорядкаВыбораСсылок.Количество()>1 Тогда
				ЛогТекущихПорядкаВыбораСсылок.Удалить(стр);
			КонецЕсли;			
		КонецЕсли;
		
		
		ТипДокументСсылка = ПолучитьОписаниеТипМетаданныхПоСсылке(ДокументСсылка);
		Элементы.ДокументСсылка.ОграничениеТипа = ТипДокументСсылка;		
		
		ОбновитьДеревоСтруктурыПодчиненности(Истина);
		
		Если ЛогТекущихПорядкаВыбораСсылок.Количество()<=1 Тогда
			Элементы.ФормаВернутьсяНазад.Доступность = Ложь;
		КонецЕсли;
	Иначе
		Сообщить("Достигли начала истории!");
	КонецЕсли	
КонецПроцедуры

#КонецОбласти

#область ФункцииДляСовместимости

&НаСервере
Функция СтруктураПодчиненностиПереопределяемый_МассивДополнительныхРеквизитовДокумента(ИмяДокумента) Экспорт
	
	МассивДопРеквизитов = Новый Массив;
	
	
	
	Возврат МассивДопРеквизитов
	
КонецФункции

&НаСервере
Функция СтруктураПодчиненностиПереопределяемый_ПолучитьПредставлениеДокументаДляПечати(Выборка) Экспорт
	
	СтруктураПодчиненностиПереопределяемый_СнятьПривилегированныйРежим();
	
	Если Не ПравоДоступа("Чтение", Выборка.Ссылка.Метаданные()) Или Не СтруктураПодчиненностиПереопределяемый_ПроверитьДоступностьОбъектаПоРЛС(Выборка.Ссылка) Тогда
		//нет прав на чтение документа
		Возврат Новый Структура("ПредставлениеДокумента,НетПравНаЧтение", Выборка.Представление, Истина);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция СтруктураПодчиненностиПереопределяемый_ИмяРеквизитаДокумента(ИмяДокумента, Реквизит) Экспорт
	
	МетаданныеДокумента = Метаданные.Документы.Найти(ИмяДокумента);
	
	Если Реквизит = "СуммаДокумента" Тогда
		Если МетаданныеДокумента.Реквизиты.Найти("СуммаДокумента") <> Неопределено Тогда
			Возврат "СуммаДокумента";
		КонецЕсли;
	ИначеЕсли Реквизит = "Валюта" Тогда
		Если МетаданныеДокумента.Реквизиты.Найти("Валюта") <> Неопределено Тогда
			Возврат "Валюта";
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция СтруктураПодчиненностиПереопределяемый_ПроверитьДоступностьОбъектаПоРЛС(СсылкаНаОбъект) Экспорт
	
	СтруктураПодчиненностиПереопределяемый_СнятьПривилегированныйРежим();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИСТИНА
	|ИЗ
	|	" + СсылкаНаОбъект.Метаданные().ПолноеИмя() + " КАК ПсевдонимЗаданнойТаблицы
	|ГДЕ
	|	ПсевдонимЗаданнойТаблицы.Ссылка = &СсылкаНаОбъект");
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);

	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

&НаСервере
Функция СтруктураПодчиненностиПереопределяемый_СнятьПривилегированныйРежим() Экспорт
	
	КоличествоОтмен = 0;
	
	Пока ПривилегированныйРежим() Цикл
		УстановитьПривилегированныйРежим(Ложь);
		КоличествоОтмен = КоличествоОтмен + 1;
	КонецЦикла;
	
	Возврат КоличествоОтмен;
	
КонецФункции
#КонецОбласти