&НаКлиенте
Перем КонтекстЯдра;

// { Plugin interface

&НаКлиенте
Функция ОписаниеПлагина(ВозможныеТипыПлагинов) Экспорт
	Возврат ОписаниеПлагинаНаСервере(ВозможныеТипыПлагинов);
КонецФункции

&НаКлиенте
Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра = КонтекстЯдраПараметр;
КонецПроцедуры

&НаСервере
Функция ОписаниеПлагинаНаСервере(ВозможныеТипыПлагинов)
	Возврат Объект().ОписаниеПлагина(ВозможныеТипыПлагинов);
КонецФункции

// } Plugin interface

// { Settings interface

&НаКлиенте
Функция ПолучитьНастройку(Знач ПутьФайлаНастройки) Экспорт
	ФайлБраузера = Новый Файл(КонтекстЯдра.ИспользуемоеИмяФайла);
	Возврат ПолучитьНастройки(ФайлБраузера, ПутьФайлаНастройки);
КонецФункции

// } Settings interface

&НаКлиенте
Функция ПолучитьНастройки(Знач ФайлБраузера, Знач ПутьФайлаНастройки)
	ИмяФайла = ПутьФайлаНастройки; //"1smoke.json";
	
	ПутьФайлаНастроек = СтрШаблон("%1%2", ФайлБраузера.Путь, ИмяФайла);
	ФайлНастроек = Новый Файл(ПутьФайлаНастроек);
	Если ФайлНастроек.Существует() Тогда
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.ОткрытьФайл(ПутьФайлаНастроек);

		Настройки = ПрочитатьJSON(ЧтениеJSON, Ложь);
		Настройки = Новый ФиксированнаяСтруктура(Настройки);
	КонецЕсли;
	Возврат Настройки;
КонецФункции

&НаСервере
Функция Объект()
	Возврат РеквизитФормыВЗначение("Объект");
КонецФункции

