Перем УтвержденияBDD;

// { БСП: Дополнительные внешние отчеты и обработки
	
Функция СведенияОВнешнейОбработке() Экспорт
	
	МетаданныеПлагина= Метаданные();
	
	РегистрационныеДанные = Новый Структура;
	
	РегистрационныеДанные.Вставить("Вид", "ДополнительнаяОбработка");
	РегистрационныеДанные.Вставить("Наименование", МетаданныеПлагина.Синоним);
	РегистрационныеДанные.Вставить("Версия", "2.0");
	РегистрационныеДанные.Вставить("БезопасныйРежим", Ложь);
	РегистрационныеДанные.Вставить("Информация", МетаданныеПлагина.Синоним);
	
	ТЗКоманды = Новый ТаблицаЗначений;
	
	ТЗКоманды.Колонки.Добавить("Идентификатор");
	ТЗКоманды.Колонки.Добавить("Представление");
	ТЗКоманды.Колонки.Добавить("Модификатор");
	ТЗКоманды.Колонки.Добавить("ПоказыватьОповещение");
	ТЗКоманды.Колонки.Добавить("Использование");    
	
	СтрокаКоманды = ТЗКоманды.Добавить();
	
	СтрокаКоманды.Идентификатор = МетаданныеПлагина.Имя;    
	СтрокаКоманды.Представление = МетаданныеПлагина.Синоним;
	СтрокаКоманды.ПоказыватьОповещение = Ложь;
	СтрокаКоманды.Использование = "ОткрытиеФормы";
	
	РегистрационныеДанные.Вставить("Команды", ТЗКоманды);    
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
    НастройкиВарианта = Вычислить("ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, ""ИмяВарианта"")");
КонецПроцедуры

Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
   Настройки.ВыводитьСуммуВыделенныхЯчеек = Истина;
КонецПроцедуры

// } БСП: Дополнительные внешние отчеты и обработки

// { Plugin interface
Функция ОписаниеПлагина(ВозможныеТипыПлагинов) Экспорт
	МетаданныеПлагина= Метаданные();
	
	Результат = Новый Структура;
	Результат.Вставить("Тип", ВозможныеТипыПлагинов.Утилита);
	Результат.Вставить("Идентификатор", МетаданныеПлагина.Имя);
	Результат.Вставить("Представление", МетаданныеПлагина.Представление());
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
КонецФункции

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	УтвержденияBDD= КонтекстЯдраПараметр.Плагин("УтвержденияBDD");
КонецПроцедуры
// } Plugin interface

Процедура ВыполнитьМетод(Знач ИмяМетода, Знач КоличествоПараметров, Знач Параметр1 = Неопределено, Знач Параметр2 = Неопределено) Экспорт
	
	СтрокаПараметры = "";
	Если КоличествоПараметров = 1 Тогда
		СтрокаПараметры = "Параметр1";
	ИначеЕсли КоличествоПараметров = 2 Тогда
		СтрокаПараметры = "Параметр1, Параметр2";
	КонецЕсли;
	
	Попытка
		Выполнить("УтвержденияBDD." + ИмяМетода + "(" + СтрокаПараметры + ")");
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ВызватьИсключение "Вызов метода <УтвержденияBDD." + ИмяМетода +">: " + ОписаниеОшибки;
	КонецПопытки;
	
КонецПроцедуры
